//  연산자
// 프로그램에서 데이터를 처리하여 겨로가를 산출할 목적으로 사용되는 문자
// 연산의 대상 값은 피연산자라고 하며, 피 연산자의 개수에 따라 단항/이항/삼항 연산자의 종류 존재

// 단항 연산자
//      부호연산자 + -
//      증감연산자 ++ --
//      논리연산자 !
//      비트연산자 ~
// 이항연산자
//      산술연산자 + - * / %
//      대입연산자 = += -=
//      비교연산자 == !=
//      논리연산자 && \\
// 삼항연산자
//      (조건식)? 참일경우의 식 : 거짓일경우의 식
// 등


// 산술 연산자
// 자바스크립트에서는 거듭제곱 연산자 **가 존재
console.log(2**3);
// 대입 연산자
// JS에서는 string끼리의 덧셈이 가능
console.log("hello" + "World");


//비교 논리 연산자
// a === b 자료형과 값이 같으면 true
// 5 == '5'는 true가 나온다
// 문자열의 비교는 문자를 순차적으로 비교를하다가 길이가 차이나면 반환

console.log("Z" > "AAA");

console.log("Hello" < "hi");

console.log("5" <= 10);

console.log(true == 1);

console.log(false != 123);

console.log(true === 1);


// 논리연산자
// && || !

